02_OpenFOAM_FVM/cases/Ejercicio5/couetteLowRe/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.1;

vertices
(
    (0 0 0)
    (1 0 0)
    (1 1 0)
    (0 1 0)
    (0 0 0.1)
    (1 0 0.1)
    (1 1 0.1)
    (0 1 0.1)
);


blocks
(
    hex (0 1 2 3 4 5 6 7) (50 500 1)
    simpleGrading
    (
        1
	(
            (0.2 0.4 20)    // 20% y-dir, 30% cells, expansion = 4
            (0.6 0.2 1)    // 60% y-dir, 40% cells, expansion = 1
            (0.2 0.4 0.05) // 20% y-dir, 30% cells, expansion = 0.25 (1/4)
        )// x-direction (i): uniform
	1                       // z-direction (k): uniform
    )
);


boundary
(
    movingWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    bottomWall
    {
        type wall;
        faces
        (
            (1 5 4 0)
        );
    }
    cyc_half0
    {
        type cyclic;
        neighbourPatch cyc_half1;
        faces
        (
            (0 4 7 3)
        );
    }
    cyc_half1
    {
        type cyclic;
        neighbourPatch cyc_half0;
        faces
        (
            (2 6 5 1)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);


// ************************************************************************* //
